articles/2017-Pautasso/Pautasso2017.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-06-23 ter 12:55 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Microservices in Practice, Part 1: Reality Check and Service Design (Review)</title>
<meta name="generator" content="Org mode" />

<link rel="stylesheet" type="text/css" href="../../HtmlTemplate/ccReport.css" />
<meta name="docClass" content= "Review">





</head>
<body>
<div id="content">
<h1 class="title">Microservices in Practice, Part 1: Reality Check and Service Design (Review)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org15645d5">1. <span class="done DONE">DONE</span> Overview</a></li>
<li><a href="#orgcc395ac">2. <span class="done DONE">DONE</span> Comments</a></li>
</ul>
</div>
</div>
<p>
Pautasso, C., Zimmermann, O., Amundsen, M., Lewis, J., &amp; Josuttis, N. (2017). Microservices in Practice, Part 1: Reality Check and Service Design. IEEE Software, 34(1), 91–98. <a href="http://doi.org/10.1109/MS.2017.24">http://doi.org/10.1109/MS.2017.24</a>
</p>

<div id="outline-container-org15645d5" class="outline-2">
<h2 id="org15645d5"><span class="section-number-2">1</span> <span class="done DONE">DONE</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
This article describes some important aspects of microservices based on specialists point of view.
</p>

<p>
Firstly, it is discussed microservices definition. One possible definition takes into consideration architectural properties and domain requirements resulting in interaction constraints. Another way to think about microservices is that they are a special approach for SOA, which place all business intelligence and data transformation at the endpoints.
Hence, microservices could be seen as a substyle refining SOA with additional constraints, for instance, less emphasis on central components (ESB or central service choreography). An interesting definition states that microservices are an approach to developing a single application as a suite of small services.  It is also discussed some XP practices, such as test-driven development and continuous integration. Hence, RESTful integration DDD and XP represent complementary practices to consider when building up microservices.
</p>

<p>
Secondly, questions about domain applications and technologies are addressed. According to the authors, in cases where we have a huge domain, microservices may be adopted successfully. Furthermore, both ubiquitous language and approaches that allow the screen design to evolve without the need for any change in code have been adopted in real implementations.  According to the authors, microservices have some principles, such as no intelligence in the service bus, no distributed transactions, and business-driven service design. In this direction, microservices should focus on business goals.
</p>

<p>
The third aspect addresses SOA analysis and design. An important thing to consider is not to split out a monolithic application into several microservices if there is no need for that. However, in cases where decomposing the monolith makes sense, it is suggested to start decomposing considering the business process and not only the domain. According to the authors, keeping the focus on interface agreement instead of code-centric objects are a better idea for designing microservices. In addition, the use of standards message models such as HTML, ATOM, HAL, Siren, etc - which allow representing hypermedia - are considered best practices. Finally, the authors state that SOA is not a project but a strategy. Hence, there is no end and cross-domain requirements are becoming part of the new culture.
</p>
</div>
</div>



<div id="outline-container-orgcc395ac" class="outline-2">
<h2 id="orgcc395ac"><span class="section-number-2">2</span> <span class="done DONE">DONE</span> Comments</h2>
<div class="outline-text-2" id="text-2">
<p>
An aspect usually used to define microservices is the focus on business goals. However, in my point of view, the specific business process reduces the level of reusability, since even process fit better-predefined expectations of a given domain. Another aspect I consider important is the separation between services that execute specific functions and services that managed the life cycle of information. Research works do not pay attention to that properly. However, this matter is always present. for instance, in this article quote "Why can’t we have just one service delivering all customer data?"
</p>

<p>
The use of semantics is not considered in this article. This has to do with microservice compositions that were not addressed either. However, the adoption of a ubiquitous language may be associated with the use of an ontology for describing the application domains involved in a given microservice application.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2017-02-04</p>
<p class="date">Created: 2020-06-23 ter 12:55</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
